# Data importing from Database

In [1]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /home/tilakkndl/anaconda3/envs/tech-axis/lib/python3.11/site-packages (9.2.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector

In [3]:
con=mysql.connector.connect(
    host= "localhost",
    user= "root",
    password= "root",
    database= "my_new_db"
)

In [4]:
#creat a cursor object using the cursor() method
cursor=con.cursor()

In [5]:
#fetch all tables
table_name="employeedetails"
cursor.execute(f"SELECT * FROM {table_name}")
print("Fetching tables")
tables=cursor.fetchall()
for table in tables:
    print(table)

Fetching tables
(4, 'Santosh', 'Kumar', 'Poudel', 18, 'Kaswstoi', 2222222, 206)
(5, 'Roshan', 'Roshan', 'jhattey', 18, 'Chandraniga', 2222222, 203)
(9, 'Ram', 'shyam', 'Ram', 18, 'kawastoi', 1111, 203)

In [6]:
import pandas as pd

In [8]:
df=pd.read_sql(f"SELECT * FROM {table_name}",con)
df

/tmp/ipykernel_6330/1552873433.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df=pd.read_sql(f"SELECT * FROM {table_name}",con)

   id    fname   mname    lname  age      address   salary  postid
0   4  Santosh   Kumar   Poudel   18     Kaswstoi  2222222     206
1   5   Roshan  Roshan  jhattey   18  Chandraniga  2222222     203
2   9      Ram   shyam      Ram   18     kawastoi     1111     203

In [12]:
#pd.read_table is used to create dataframe from a table not from a query result and does not work with mysql database
#pd.read_sql_query is used to create dataframe from a query result
#pd.read_sql is used to create dataframe from a table or a query result